[{"_meta":{"id":"5af7b45aa9cbb30013aca546","name":"New Document","updatedAt":1526183347640,"createdAt":1526183002309,"published":false},"author":{"bio":"Austin Lanari is a software engineer who likes to test new things before there is much documentation about them. He likes to think this process is sort of like how Saiyans' bodies are stronger after they get beaten half to death, but for his pride and his brain.","name":"Austin Lanari","_meta":{"id":"5af7b4916280100013952134","name":"New Document","updatedAt":1526183253022,"createdAt":1526183057061,"published":false}},"body":"This is blog post number one. It has some kind of crazy id and I'd like to display it next to another blog post on my gatsby page without having to individually fetch each one.","featuredImage":{"id":"5add4b83599b450013e6c3ac","name":"best","size":71075,"url":"https://cdn.tipe.io/tipe/best.png","mime":"image/png"},"title":"First Blog Post","urlSlug":"first-blog-post"},{"_meta":{"id":"5af7b5b86280100013952137","name":"New Document","updatedAt":1526183762607,"createdAt":1526183352694,"published":false},"author":{"bio":"Austin Lanari is a software engineer who likes to test new things before there is much documentation about them. He likes to think this process is sort of like how Saiyans' bodies are stronger after they get beaten half to death, but for his pride and his brain.","name":"Austin Lanari","_meta":{"id":"5af7b4916280100013952134","name":"New Document","updatedAt":1526183253022,"createdAt":1526183057061,"published":false}},"body":"This is my second blog post. If I was using a more advanced Gatsby starter (i.e. one where somebody already did a lot of work for me), I could just slap this text in a markdown file in a particular folder and `gatsby-node.js` would have logic to slip it into the proper graphQL node. Somewhere, there'd be logic to render a link to each node and _voila_.\n\nOut of the box, there is not yet a gatsby plugin for tipe. So, the best I can currently do (and I'm hoping this works because I'm taking all this time to write my plan out) is treat the remote tipe folder as if it were the gatsby folder. Somehow, I need to query this special folder with my blogposts in it (by id) and I need to get the json that is dumped with the blog post content as a result out of the graphql loaded via `tipe-loader` and take that and inject it via `gatsby-node` into gatsby's graphql logic.\n\nAlternatively, I could skip the `gatsby-node` step, but this feels sloppy becuase 1. There's no guarantee that Tipe will be the only source of truth for my content going forward and 2. if Tipe ultimately loaded via the `gatsby-source` ecosystem, it would be exposed via gatsby and not just pulled out of the sky in json in my js files. A third factor is, that if we respect gatsby as a tool and want to make Tipe fit the ecosystem, we should be _trying_ to get Tipe to operate _within_ that ecosystem as much as humanly possible.\n\nOk damnit this was supposed to be a test post.\n\n","featuredImage":{"id":"5add4b83599b450013e6c3ae","name":"learn","size":67852,"url":"https://cdn.tipe.io/tipe/learn.png","mime":"image/png"},"title":"Tipe & Gatsby","urlSlug":"tipe-and-gatsby"}]